app/controllers/carts_controller.rb

  def destroy
    @cart = Cart.find(params[:id])
    @Cart = current_cart
    @cart.destroy
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]