app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    @line_item.product = product

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 09 Jul 2013 21:03:31 UTC +00:00], ["updated_at", Tue, 09 Jul 2013 21:03:31 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 23], ["created_at", Wed, 10 Jul 2013 12:04:06 UTC +00:00], ["product_id", 3], ["quantity", 1], ["updated_at", Wed, 10 Jul 2013 12:04:06 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 3, "updated_at" = '2013-07-11 22:10:21.277922' WHERE "line_items"."id" = 174