app/controllers/products_controller.rb

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "products" SET "description" = 'CoffeeScript is Cool too! kidhaskjdhakjdhaskjhdaskhjdasjhdkjashdkjahdkjashdkjhsdkjhakjhsadkjhaskjdhaskdjhaskjdhaskhdskjahdkashkdjahkjsdhas bukah!', "price" = 99.99, "updated_at" = '2013-07-08 20:33:37.604123' WHERE "products"."id" = 3