app/controllers/store_controller.rb

SELECT "products".* FROM "products" ORDER BY title
---
  def index
    @cart = current_cart
    @products = Product.order(:title)